of/org/potential/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          27;
        startFace       302;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          33;
        startFace       329;
    }
    inlet
    {
        type            patch;
        nFaces          6;
        startFace       362;
    }
    outlet
    {
        type            patch;
        nFaces          6;
        startFace       368;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       374;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          348;
        startFace       394;
    }
)

// ************************************************************************* //
